{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-GENERAL_MEDICINE",
    "2": "I-GENERAL_MEDICINE",
    "3": "B-CARDIOLOGY",
    "4": "I-CARDIOLOGY",
    "5": "B-RESPIRATORY",
    "6": "I-RESPIRATORY",
    "7": "B-PEDIATRICS",
    "8": "I-PEDIATRICS",
    "9": "B-DERMATOLOGY",
    "10": "I-DERMATOLOGY",
    "11": "B-NEUROLOGY",
    "12": "I-NEUROLOGY",
    "13": "B-ENT",
    "14": "I-ENT",
    "15": "B-OB_GYN",
    "16": "I-OB_GYN",
    "17": "B-ORTHOPEDICS",
    "18": "I-ORTHOPEDICS",
    "19": "B-OPHTHALMOLOGY",
    "20": "I-OPHTHALMOLOGY",
    "21": "B-GASTROENTEROLOGY",
    "22": "I-GASTROENTEROLOGY",
    "23": "B-DENTISTRY",
    "24": "I-DENTISTRY",
    "25": "B-UROLOGY",
    "26": "I-UROLOGY",
    "27": "B-ENDOCRINOLOGY",
    "28": "I-ENDOCRINOLOGY",
    "29": "B-PSYCHIATRY",
    "30": "I-PSYCHIATRY",
    "31": "B-ONCOLOGY",
    "32": "I-ONCOLOGY",
    "33": "B-EMERGENCY",
    "34": "I-EMERGENCY"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-CARDIOLOGY": 3,
    "B-DENTISTRY": 23,
    "B-DERMATOLOGY": 9,
    "B-EMERGENCY": 33,
    "B-ENDOCRINOLOGY": 27,
    "B-ENT": 13,
    "B-GASTROENTEROLOGY": 21,
    "B-GENERAL_MEDICINE": 1,
    "B-NEUROLOGY": 11,
    "B-OB_GYN": 15,
    "B-ONCOLOGY": 31,
    "B-OPHTHALMOLOGY": 19,
    "B-ORTHOPEDICS": 17,
    "B-PEDIATRICS": 7,
    "B-PSYCHIATRY": 29,
    "B-RESPIRATORY": 5,
    "B-UROLOGY": 25,
    "I-CARDIOLOGY": 4,
    "I-DENTISTRY": 24,
    "I-DERMATOLOGY": 10,
    "I-EMERGENCY": 34,
    "I-ENDOCRINOLOGY": 28,
    "I-ENT": 14,
    "I-GASTROENTEROLOGY": 22,
    "I-GENERAL_MEDICINE": 2,
    "I-NEUROLOGY": 12,
    "I-OB_GYN": 16,
    "I-ONCOLOGY": 32,
    "I-OPHTHALMOLOGY": 20,
    "I-ORTHOPEDICS": 18,
    "I-PEDIATRICS": 8,
    "I-PSYCHIATRY": 30,
    "I-RESPIRATORY": 6,
    "I-UROLOGY": 26,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "tie_word_embeddings": true,
  "tokenizer_class": "PhobertTokenizer",
  "transformers_version": "5.0.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 64001
}
